1 Alerts Raised Over Time 

SecurityIncident 
| where CreatedTime >= ago(7d) and CreatedTime <= now()
| where Severity in ('*') or "*" in ('*')
| extend Tactics = todynamic(AdditionalData.tactics)
| where Tactics in ('*') or "*" in ('*')
| extend Owner = todynamic(Owner.assignedTo) 
| where Owner in ('*') or "*" in ('*')
| extend Product = todynamic((parse_json(tostring(AdditionalData.alertProductNames))[0])) 
| where Product in ('*') or "*" in ('*')
| summarize Incidents=dcount(IncidentNumber) by Severity, bin(CreatedTime, 1d)
