SecurityIncident
| where ClosedTime  >= ago(30d) and ClosedTime  <= now()
| where Severity in ('*') or "*" in ('*')
| extend Tactics = todynamic(AdditionalData.tactics)
| where Tactics in ('*') or "*" in ('*')
| extend Owner = todynamic(Owner.assignedTo) 
| where Owner in ('*') or "*" in ('*')
| extend Product = todynamic((parse_json(tostring(AdditionalData.alertProductNames))[0])) 
| where Product in ('*') or "*" in ('*')
| summarize arg_max(LastModifiedTime,*) by IncidentNumber 
| extend TimeToClosure =  (ClosedTime - CreatedTime)/1h
| summarize MeanTimeToClose=percentile(TimeToClosure, 99) by bin(ClosedTime, 1d)